mui.init({swipeBack: false
,gestureConfig: {tap:true,doubletap:true,longtap:true,hold:true,release:true}});

var 高级选项卡1 = new 高级选项卡("高级选项卡1",高级选项卡1_选项卡被切换);
var 自由面板1 = new 自由面板("自由面板1","64px");
var s = new 编辑框("s",s_被单击,null,null,null,null);
var e = new 编辑框("e",e_被单击,null,null,null,null);
var 三行列表框 = new 渐渐三行列表框("三行列表框",三行列表框_被单击);
var 列表框 = new 高级列表框("列表框",false,true,false,null);
var CYS日期时间选择器1 = new CYS日期时间选择器("CYS日期时间选择器1",CYS日期时间选择器1_日期被选择);
var CYS日期时间选择器2 = new CYS日期时间选择器("CYS日期时间选择器2",CYS日期时间选择器2_日期被选择);
var 按钮1 = new 按钮("按钮1",按钮1_被单击,null,null);
var qb = new 网络操作("qb",qb_发送完毕);
var 自由面板2 = new 自由面板("自由面板2","116px");
var 按钮2 = new 按钮("按钮2",按钮2_被单击,null,null);
var 按钮3 = new 按钮("按钮3",按钮3_被单击,null,null);
var 按钮4 = new 按钮("按钮4",按钮4_被单击,null,null);
var 页数显示 = new 编辑框("页数显示",null,null,null,null,null);
var 按钮5 = new 按钮("按钮5",按钮5_被单击,null,null);
var ren = new 网络操作("ren",ren_发送完毕);
if(mui.os.plus){
    mui.plusReady(function() {
        管理面板_创建完毕();
        
    });
}else{
    window.onload=function(){ 
        管理面板_创建完毕();
        
    }
}
window.onresize=function(){
	管理面板_窗口尺寸改变();
};

var etime;
	var stime;
	var id ;
	var pass;
	var ip;
	var 当前页数;
function 管理面板_创建完毕(){
	id = 读写设置.读取设置("adminidtmp4159690");
	pass = 读写设置.读取设置("passtmp4159690");
	ip = 读写设置.读取设置("ip");
		高级选项卡1.置选项卡标题(0,"用车记录");
		高级选项卡1.置选项卡标题(1,"用户人员");
		高级选项卡1.置选项卡标题(2,"暂无..");
	if( 时间操作.取时间戳(时间操作.取当前日期时间()) - 转换操作.到数值(窗口操作.取当前页面参数("t")) < 50000000 ){
		CYS日期时间选择器1.初始化(1,2019,2020);
		CYS日期时间选择器2.初始化(1,2019,2020);
		当前页数=0;
		高级选项卡1.添加组件(0,"自由面板1");

		获取全部列表();
		获取人 ();

	}else{
	  窗口操作.切换窗口("index.html");
	}
	s.置只读模式(true);
	e.置只读模式(true);
	调整组件尺寸();
}
function 获取全部列表(){
	页数显示.置内容(转换操作.到文本(当前页数+1));
			qb.发送网络请求(ip+"quanbudingdan.php",
						    "post",
							"text",
							{"token":"adsjkhjkabewiab_ajshdnasm","start":转换操作.到文本(当前页数*10),"end":转换操作.到文本(当前页数*10+10)},
							5000);
}
function 取作业区 (序号){
		switch(序号){
		case "0" :
			return "炼焦作业区";
		break;
		case "1" :
			return "干熄焦作业区";
		break;
		case "2" :
			return "综合办公室";
		break;
		case "3" :
			return "计财室";
		break;
		case "4" :
			return "化验室";
		break;
		case "5" :
			return "设备工程室";
		break;
		case "6" :
			return "经营销售室";
		break;
		case "7" :
			return "化工作业区";
		break;
		case "8" :
			return "安全管理室";
		break;
		case "9" :
			return "生产技术室";
		break;
	}
}


function s_被单击(){
	CYS日期时间选择器1.弹出();
}

function e_被单击(){
	CYS日期时间选择器2.弹出();
}

function 管理面板_窗口尺寸改变(){
	调整组件尺寸();
}

function 调整组件尺寸(){





	窗口操作.置组件左边("s","" + (1/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("s","" + (40/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("e","" + (41/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("e","" + (40/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("按钮1","" + (84/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("按钮1","" + (45/320 * 窗口操作.取窗口宽度()) + "px");


	窗口操作.置组件左边("按钮2","" + (2/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("按钮2","" + (40/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("按钮3","" + (43/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("按钮3","" + (40/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("按钮4","" + (84/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("按钮4","" + (40/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("页数显示","" + (164/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("页数显示","" + (16/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("按钮5","" + (181/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("按钮5","" + (32/320 * 窗口操作.取窗口宽度()) + "px");

}

function CYS日期时间选择器1_日期被选择(年,月,日,时,分){

	stime =文本操作.取文本左边(转换操作.到文本(时间操作.取时间戳(时间操作.到日期时间2(转换操作.到文本(年)+"/"+转换操作.到文本(月)+"/"+转换操作.到文本(日)+" 00:00:00"))),10);
	s.置内容(转换操作.到文本(年)+"-"+转换操作.到文本(月)+"-"+转换操作.到文本(日));
}

function CYS日期时间选择器2_日期被选择(年,月,日,时,分){
	etime =文本操作.取文本左边(转换操作.到文本(时间操作.取时间戳(时间操作.到日期时间2(转换操作.到文本(年)+"/"+转换操作.到文本(月)+"/"+转换操作.到文本(日)+" 00:00:00"))),10);
	e.置内容(转换操作.到文本(年)+"-"+转换操作.到文本(月)+"-"+转换操作.到文本(日));
}

function 按钮1_被单击(){
窗口操作.打开指定网址(ip+ "/administra/ex.php?id="+id+"&pass="+pass+"&start="+stime+"&end="+etime,2);
}

function qb_发送完毕(发送结果,返回信息){
	var 分割;
	var 二次分割;
	var 计次;

	console.log (返回信息);
	计次 =0;
	if(发送结果 == true && 发送结果 != "0" ){
		分割 = 文本操作.分割文本(返回信息,"<br />");
		while(计次  <  数组操作.取成员数(分割)-1){
			二次分割 = 文本操作.分割文本(分割[计次],"-");
			if(二次分割[8] == "1" ){
				三行列表框.添加项目(取作业区 (二次分割[7])+":"+二次分割[2],"目的地："+二次分割[9]+"-"+二次分割[10],"用车事由："+二次分割[5],时间操作.时间到文本(时间操作.时间戳到时间(转换操作.到数值(二次分割[4])))+"<br/>订单已完成",分割[计次] );
			}else{
			    三行列表框.添加项目(取作业区 (二次分割[7])+":"+二次分割[2],"目的地："+二次分割[9]+"-"+二次分割[10],"用车事由："+二次分割[5],时间操作.时间到文本(时间操作.时间戳到时间(转换操作.到数值(二次分割[4])))+"<br/>订单进行中",分割[计次] );
			}

			计次 = 计次 + 1;
		}
	}
}

function 三行列表框_被单击(表项索引){

	三行列表框.取项目标记(表项索引);
}


function 按钮2_被单击(){
	当前页数 =0;
	三行列表框.清空项目();
	列表框.清空项目();
	获取全部列表();
	获取人 ();
}

function 按钮3_被单击(){
	当前页数 =当前页数-1;
	三列表框.清空项目();
	列表框.清空项目();
	获取全部列表();
	获取人 ();
}

function 按钮4_被单击(){
	当前页数 =当前页数+1;
	三行列表框.清空项目();
	列表框.清空项目();
	获取全部列表();
	获取人 ();
}

function 按钮5_被单击(){
	当前页数 =转换操作.到数值(页数显示.取内容())-1;
	三行列表框.清空项目();
	获取全部列表();
}


function 获取人 (){
	页数显示.置内容(转换操作.到文本(当前页数+1));
	ren.发送网络请求(ip+ "/administra/user.php?id="+id+"&pass="+pass+"&start="+转换操作.到文本(当前页数*10)+"&end="+转换操作.到文本(当前页数*10+10));
}

function ren_发送完毕(发送结果,返回信息){
	var 分割;
	var 二次分割;
	var 计次;
	console.log (返回信息);

	计次 =0;
	if(发送结果 == true && 发送结果 != "0" ){
		分割 = 文本操作.分割文本(返回信息,"<br />");
		while(计次  <  数组操作.取成员数(分割)-1){
			二次分割 = 文本操作.分割文本(分割[计次],"-");
			console.log (转换操作.到文本(数组操作.取成员数(二次分割) ));

			if(二次分割[1] != "" ){


					if(数组操作.取成员数(二次分割) == 6 ){
						if(二次分割[5] =="0" || 二次分割[5] =="" ){
							 列表框.添加项目("images/user.png",二次分割[1],取作业区(二次分割[2]),分割[计次]);
						}else{
							列表框.添加项目(二次分割[5],二次分割[1],取作业区(二次分割[2]),分割[计次]);
						}
					}else{
						if(二次分割[5] =="0" || 二次分割[5] =="" ){
							 列表框.添加项目("images/user.png",二次分割[1],取作业区(二次分割[2]),分割[计次]);
						}else{
							列表框.添加项目(二次分割[5],二次分割[1],取作业区(二次分割[2])+" "+二次分割[6],分割[计次]);
						}

					}


			}




			计次 = 计次 + 1;
		}
	}
}

function 高级选项卡1_选项卡被切换(索引){
	当前页数 =0;
	三行列表框.清空项目();
	列表框.清空项目();
	获取全部列表();
	获取人 ();

	switch(索引){
		case 0 :
			列表框.置可视(false);
			三行列表框.置可视(true);
		break;
		case 1 :
			列表框.置可视(true);
			三行列表框.置可视(false);
		break;
		case 2 :
			列表框.置可视(false);
			三行列表框.置可视(false);
		break;
	}

}