mui.init({swipeBack: false
,gestureConfig: {tap:true,doubletap:true,longtap:true,hold:true,release:true}});

var 自由面板1 = new 自由面板("自由面板1","250px");
var 编辑框1 = new 编辑框("编辑框1",null,null,null,null,null);
var 编辑框2 = new 编辑框("编辑框2",null,null,null,null,null);
var 标签1 = new 标签("标签1",null);
var 图片框1 = new 图片框("图片框1",图片框1_被单击);
var 复选框1 = new 复选框("复选框1",null);
var 图片框2 = new 图片框("图片框2",null);
var curl = new 网络操作("curl",curl_发送完毕);
var 对话框1 = new 对话框("对话框1",null,null,null);
if(mui.os.plus){
    mui.plusReady(function() {
        主窗口_创建完毕();
        
    });
}else{
    window.onload=function(){ 
        主窗口_创建完毕();
        
    }
}
window.onresize=function(){
	主窗口_窗口尺寸改变();
};

function 主窗口_创建完毕(){
	自由面板1.置背景颜色("#FFFFFF");
	读写设置.保存设置("ip","http://49.235.217.249/");
	编辑框1.置内容(读写设置.读取设置("idadmin"));

	编辑框2.置内容(读写设置.读取设置("passadmiin"));
	if(编辑框1.取内容() !="" ){
		复选框1.置选中状态(true);
	}
	调整组件尺寸();
}


function 主窗口_窗口尺寸改变(){
	调整组件尺寸();
}
function 调整组件尺寸(){

窗口操作.置组件高度("自由面板1","" + (250/480 * 窗口操作.取窗口高度()) + "px");
	窗口操作.置组件顶边("编辑框1","" + (166/480 * 窗口操作.取窗口高度()) + "px");

	窗口操作.置组件顶边("编辑框2",窗口操作.取组件顶边("编辑框1")+窗口操作.取组件高度("编辑框1") + "px");

	窗口操作.置组件左边("标签1","" + (0/320 * 窗口操作.取窗口宽度()) + "px");
	窗口操作.置组件顶边("标签1","" + (121/480 * 窗口操作.取窗口高度()) + "px");
	窗口操作.置组件宽度("标签1","" + (320/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("编辑框1","" +窗口操作.取窗口宽度()/2-窗口操作.取组件宽度("编辑框1")/2 + "px");
	窗口操作.置组件左边("编辑框2","" +窗口操作.取窗口宽度()/2-窗口操作.取组件宽度("编辑框2")/2 + "px");
	窗口操作.置组件左边("图片框1","" +窗口操作.取窗口宽度()/2-窗口操作.取组件宽度("编辑框2")/2 + 窗口操作.取组件宽度("编辑框2") -  窗口操作.取组件宽度("图片框1")-4+ "px");
	窗口操作.置组件顶边("图片框1",窗口操作.取组件顶边("编辑框2") +4+ "px");
	窗口操作.置组件外边距("复选框1","0","0","0",窗口操作.取窗口宽度()/2-窗口操作.取组件宽度("编辑框2")/3 + "px");
}


function 图片框1_被单击(){
	对话框1.显示等待框("登录中");
	if(复选框1.取选中状态() ==true ){
		读写设置.保存设置("idadmin",编辑框1.取内容());
		读写设置.保存设置("passadmiin",编辑框2.取内容());

	}else{
		读写设置.保存设置("idadmin","");
		读写设置.保存设置("passadmiin","");
	}
	curl.发送网络请求( 读写设置.读取设置("ip")+ "/administra/sign.php?id="+编辑框1.取内容()+"&pass="+编辑框2.取内容());
}

function curl_发送完毕(发送结果,返回信息){
	if(返回信息 == "1" ){
		读写设置.保存设置("adminidtmp4159690",编辑框1.取内容());
		读写设置.保存设置("passtmp4159690",编辑框2.取内容());
		窗口操作.切换窗口("administrator.html?&t="+转换操作.到文本( 时间操作.取时间戳(时间操作.取当前日期时间())));
	}else{
	  对话框1.弹出提示(返回信息);
	}
}