mui.init({swipeBack: false
,gestureConfig: {tap:true,doubletap:true,longtap:true,hold:true,release:true}});

var 自由面板1 = new 自由面板("自由面板1","536px");
var 图片框1 = new 图片框("图片框1",null);
var 图片框2 = new 图片框("图片框2",图片框2_被单击);
var 图片框3 = new 图片框("图片框3",图片框3_被单击);
var 图片框4 = new 图片框("图片框4",null);
var 图片框5 = new 图片框("图片框5",null);
var 标签1 = new 标签("标签1",null);
if(mui.os.plus){
    mui.plusReady(function() {
        主窗口_创建完毕();
        
    });
}else{
    window.onload=function(){ 
        主窗口_创建完毕();
        
    }
}
window.onresize=function(){
	主窗口_窗口尺寸改变();
};

function 主窗口_创建完毕(){
调整组件尺寸();
}

function 主窗口_窗口尺寸改变(){
	调整组件尺寸();
}
function 调整组件尺寸(){


	窗口操作.置组件左边("图片框2","" + (8/320 * 窗口操作.取窗口宽度()) + "px");
	窗口操作.置组件顶边("图片框2","" + 转换操作.到文本 (窗口操作.取组件顶边("图片框1")+窗口操作.取组件高度("图片框1") + 20) + "px");
	窗口操作.置组件宽度("图片框2","" + (132/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件左边("图片框3","" + (173/320 * 窗口操作.取窗口宽度()) + "px");
	窗口操作.置组件顶边("图片框3","" +转换操作.到文本(窗口操作.取组件顶边("图片框1")+窗口操作.取组件高度("图片框1") + 20) + "px");
	窗口操作.置组件宽度("图片框3","" + (132/320 * 窗口操作.取窗口宽度()) + "px");





	窗口操作.置组件左边("图片框4","" + (0/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("图片框4","" + (320/320 * 窗口操作.取窗口宽度()) + "px");
窗口操作.置组件高度("图片框4","" + (窗口操作.取窗口高度()) + "px");
	窗口操作.置组件左边("图片框5","" + (0/320 * 窗口操作.取窗口宽度()) + "px");

	窗口操作.置组件宽度("图片框5","" +  窗口操作.取窗口宽度() + "px");
窗口操作.置组件高度("图片框5","" + (232/480 * 窗口操作.取窗口高度()) + "px");



	窗口操作.置组件宽度("标签1","" + (窗口操作.取窗口宽度()) + "px");


	窗口操作.置组件左边("图片框1","" + (窗口操作.取窗口宽度()/2-窗口操作.取组件宽度("图片框1")/2) + "px");
	窗口操作.置组件高度("自由面板1","" +(10+ 窗口操作.取组件顶边("图片框3") + 窗口操作.取组件高度("图片框3") )+ "px");
}

function 图片框2_被单击(){
	if(窗口操作.是否在微信内运行() == true ){
		调整组件尺寸();
		图片框4.置可视(true);
		图片框5.置可视(true);
	}else{
	  窗口操作.打开指定网址("./com.sgjtxsjh.bgyc.apk",1);
	}
}

function 图片框3_被单击(){
	窗口操作.打开指定网址("https://testflight.apple.com/join/rDCFVPbJ",1);
}